Repository: LiziRam/LiziRamishvili
Catalog: Day_39/PizzaRestaurant/PizzaRestaurant.API/Infrastructure/Localisations/ErrorMessages.*.resx
Languages: ka_ge

# CityValidationError
source: City field should not be empty, name should be 15 characters at most
ka_ge: ქალაქის ველი არ უნდა იყოს ცარიელი, სახელი უნდა იყოს მაქსიმუმ 15 სიმბოლოს სიგრძის

# CountryValidationError
source: Country field should not be empty, name should be 15 characters at most
ka_ge: ქვეყნის ველი არ უნდა იყოს ცარიელი, სახელი უნდა იყოს მაქსიმუმ 15 სიმბოლოს სიგრძის

# DescriptionValidationError
source: Description should be 100 characters at most
ka_ge: აღწერა უნდა იყოს მაქსიმუმ 100 სიმბოლოს სიგრძის

# RegionValidationError
source: Region's name should be 15 characters at most
ka_ge: რეგიონის სახელი უნდა იყოს მაქსიმუმ 15 სიმბოლოს სიგრძის

# PizzaIdValidationError
source: Pizza Id field should not be empty
ka_ge: პიცის აიდის ველი არ უნდა იყოს ცარიელი

# UserIdValidationError
source: User Id field should not be empty
ka_ge: იუზერის აიდის ველი არ უნდა იყოს ცარიელი

# AddressIdValidationError
source: Address Id field should not be empty
ka_ge: მისამართის აიდის ველი არ უნდა იყოს ცარიელი

# PizzaNameValidationError
source: Pizza Name field shoud not be empty, number of characters should be at least 3 and at most 20
ka_ge: პიცის სახელის ველი აუცილებლად უნდა შეივსოს, სიმბოლოების რაოდენობა უნდა იყოს 3-20 შუალედში

# PriceValidationError
source: Pizza Price filed should not be empty, price should be more than 0
ka_ge: პიცის ფასის ველი აუცილებლად უნდა შეივსოს და იყოს 0-ზე მეტი მნიშვნელობის

# CaloryCountValidationError
source: Pizza CaloryCount filed should not be empty, caloryCount should be more than 0
ka_ge: პიცის კალორიების ველი აუცილებლად უნდა შეივსოს და იყოს 0-ზე მეტი მნიშვნელობის

# RankValidationError
source: Rank should be between 1 and 10
ka_ge: შეფასება უნდა იყოს 1-სა და 10-ს შორის

# FirstNameValidationError
source: First Name field should not be empty, number of characters should be between 2 and 20
ka_ge: სახელის ველი არ უნდა იყოს ცარიელი, სიმბოლოების რაოდენობა უნდა იყოს 2-დან 20-მდე

# LastNameValidationError
source: Last Name field should not be empty, number of characters should be between 2 and 30
ka_ge: გვარის ველი არ უნდა იყოს ცარიელი, სიმბოლოების რაოდენობა უნდა იყოს 2-დან 30-მდე

# PhoneNumberValidationError
source: Phone Number should follow the standard
ka_ge: ნომერი უნდა აკმაყოფილებდეს სტანდარტს

# EmailValidationError
source: Email should follow the standar
ka_ge: მეილი უნდა აკმაყოფილებდეს სტანდარტს
